# 演習１４～１７

[Google Colaboratoryで開く](https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_14_to_17.ipynb)

<a target="_blank" href="https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_14_to_17.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

**sqliteをロード**

In [ ]:
%reload_ext sql
%sql sqlite:///:memory:

**t_employeeテーブル（従業員表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS employee;
CREATE TABLE "employee" (
	"employee_id"	INTEGER,		-- 従業員番号
	"name"		TEXT NOT NULL,	-- 氏名
	"mail"		TEXT,		-- メールアドレス
	"hire_date"	DATE,		-- 入社日
	"salary"		INTEGER,		-- 月給
	"dept_id"	INTEGER,		-- 所属部門番号
	PRIMARY KEY("employee_id")
);
-- 従業員データ
INSERT INTO employee VALUES(1,'梅津 玲那','umedu_rena@example.com','1987-07-03',452000,2);
INSERT INTO employee VALUES(2,'米谷 朝陽','yoneya_asahi@example.com','1990-10-01',428280,3);
INSERT INTO employee VALUES(3,'古田 沙知絵','furuta_sachie@example.com','1991-02-26',425320,4);
INSERT INTO employee VALUES(4,'細川 ちえみ','hosokawa_chiemi@example.com','2002-11-25',339520,4);
INSERT INTO employee VALUES(5,'宇田川 雅紀','utagawa_masanori@example.com','2002-12-28',338860,5);
INSERT INTO employee VALUES(6,'柴山 恭子','shibayama_kyouko@example.com','2008-06-04',299160,3);
INSERT INTO employee VALUES(7,'竹下 明日','takeshita_meibi@example.com','2019-08-12',217440,5);
INSERT INTO employee VALUES(8,'下山 草太','shimoyama_souta@example.com','2021-01-02',207260,NULL);

**itemテーブル（商品表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS item;
CREATE TABLE "item" (
	"item_id"	INTEGER,		-- 商品番号
	"name"		TEXT NOT NULL,	-- 商品名
	"price"		INTEGER,		-- 価格
	PRIMARY KEY("item_id")
);
-- 商品データ
INSERT INTO "item" VALUES ('1', '４Ｋ液晶ＴＶ', '80000');
INSERT INTO "item" VALUES ('2', '事務用電卓機', '6000');
INSERT INTO "item" VALUES ('3', '室内用空清機', '29000');
INSERT INTO "item" VALUES ('4', 'ノートナルプ', '70000');
INSERT INTO "item" VALUES ('5', '一眼デジカメ', '65000');

**salesテーブル（取引表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS sales;
CREATE TABLE "sales" (
	"sales_id"	INTEGER,			-- 取引番号
	"item_id"	INTEGER NOT NULL,	-- 商品番号
	"employee_id"	INTEGER,			-- 従業員番号
	"sales_date"	DATE,			-- 取引日
	PRIMARY KEY("sales_id")
);
-- 商品データ
INSERT INTO "sales" VALUES (1,1,7,'2021-12-01');
INSERT INTO "sales" VALUES (2,2,4,'2021-12-01');
INSERT INTO "sales" VALUES (3,3,4,'2021-12-01');
INSERT INTO "sales" VALUES (4,1,4,'2021-12-02');
INSERT INTO "sales" VALUES (5,3,6,'2021-12-02');
INSERT INTO "sales" VALUES (6,2,2,'2021-12-02');
INSERT INTO "sales" VALUES (7,3,5,'2021-12-03');
INSERT INTO "sales" VALUES (8,5,7,'2021-12-03');
INSERT INTO "sales" VALUES (9,5,4,'2021-12-04');
INSERT INTO "sales" VALUES (10,3,2,'2021-12-04');
INSERT INTO "sales" VALUES (11,5,5,'2021-12-06');
INSERT INTO "sales" VALUES (12,2,6,'2021-12-06');
INSERT INTO "sales" VALUES (13,2,5,'2021-12-07');
INSERT INTO "sales" VALUES (14,4,5,'2021-12-07');
INSERT INTO "sales" VALUES (15,3,3,'2021-12-07');
INSERT INTO "sales" VALUES (16,3,5,'2021-12-08');
INSERT INTO "sales" VALUES (17,1,4,'2021-12-08');
INSERT INTO "sales" VALUES (18,2,7,'2021-12-08');
INSERT INTO "sales" VALUES (19,1,4,'2021-12-08');
INSERT INTO "sales" VALUES (20,3,2,'2021-12-09');
INSERT INTO "sales" VALUES (21,4,5,'2021-12-09');
INSERT INTO "sales" VALUES (22,5,4,'2021-12-09');
INSERT INTO "sales" VALUES (23,1,4,'2021-12-10');
INSERT INTO "sales" VALUES (24,1,7,'2021-12-10');
INSERT INTO "sales" VALUES (25,2,2,'2021-12-10');
INSERT INTO "sales" VALUES (26,4,5,'2021-12-11');
INSERT INTO "sales" VALUES (27,4,5,'2021-12-11');
INSERT INTO "sales" VALUES (28,3,1,'2021-12-12');
INSERT INTO "sales" VALUES (29,2,3,'2021-12-12');
INSERT INTO "sales" VALUES (30,4,5,'2021-12-13');
INSERT INTO "sales" VALUES (31,2,6,'2021-12-14');
INSERT INTO "sales" VALUES (32,1,7,'2021-12-14');
INSERT INTO "sales" VALUES (33,3,6,'2021-12-15');
INSERT INTO "sales" VALUES (34,1,6,'2021-12-15');
INSERT INTO "sales" VALUES (35,2,7,'2021-12-16');
INSERT INTO "sales" VALUES (36,5,6,'2021-12-16');
INSERT INTO "sales" VALUES (37,1,6,'2021-12-16');
INSERT INTO "sales" VALUES (38,5,6,'2021-12-16');
INSERT INTO "sales" VALUES (39,1,2,'2021-12-16');
INSERT INTO "sales" VALUES (40,1,5,'2021-12-17');
INSERT INTO "sales" VALUES (41,3,6,'2021-12-18');
INSERT INTO "sales" VALUES (42,1,4,'2021-12-18');
INSERT INTO "sales" VALUES (43,2,2,'2021-12-19');
INSERT INTO "sales" VALUES (44,1,6,'2021-12-19');
INSERT INTO "sales" VALUES (45,5,1,'2021-12-19');
INSERT INTO "sales" VALUES (46,2,3,'2021-12-20');
INSERT INTO "sales" VALUES (47,1,4,'2021-12-20');
INSERT INTO "sales" VALUES (48,1,7,'2021-12-21');
INSERT INTO "sales" VALUES (49,1,2,'2021-12-21');
INSERT INTO "sales" VALUES (50,4,5,'2021-12-22');
INSERT INTO "sales" VALUES (51,5,4,'2021-12-22');
INSERT INTO "sales" VALUES (52,5,3,'2021-12-24');
INSERT INTO "sales" VALUES (53,5,3,'2021-12-24');
INSERT INTO "sales" VALUES (54,3,1,'2021-12-25');
INSERT INTO "sales" VALUES (55,5,1,'2021-12-25');
INSERT INTO "sales" VALUES (56,4,5,'2021-12-25');
INSERT INTO "sales" VALUES (57,5,2,'2021-12-26');
INSERT INTO "sales" VALUES (58,2,7,'2021-12-27');
INSERT INTO "sales" VALUES (59,1,3,'2021-12-27');
INSERT INTO "sales" VALUES (60,2,7,'2021-12-27');
INSERT INTO "sales" VALUES (61,2,7,'2021-12-28');
INSERT INTO "sales" VALUES (62,2,5,'2021-12-29');
INSERT INTO "sales" VALUES (63,5,7,'2021-12-29');
INSERT INTO "sales" VALUES (64,2,2,'2021-12-29');
INSERT INTO "sales" VALUES (65,5,2,'2021-12-29');
INSERT INTO "sales" VALUES (66,5,1,'2021-12-30');
INSERT INTO "sales" VALUES (67,1,6,'2021-12-30');
INSERT INTO "sales" VALUES (68,5,5,'2021-12-31');
INSERT INTO "sales" VALUES (69,1,2,'2021-12-31');
INSERT INTO "sales" VALUES (70,4,5,'2021-12-31');
INSERT INTO "sales" VALUES (71,3,3,'2021-12-31');

**演習１４**
item表とsales表から、sales_dateが'2021-12-10'から'2021-12-11'の範囲内である行の商品名と取引日を照会

In [ ]:
%%sql
SELECT
  item.name AS 商品名,
  sales.sales_date AS 取引日
FROM
  sales
    INNER JOIN
  item
ON
  sales.item_id = item.item_id
WHERE
  sales.sales_date BETWEEN '2021-12-10' AND '2021-12-11'
;

**演習１５**
item表、sales表、employee表から、sales_dateが'2021-12-10'から'2021-12-11'の範囲内である行の取引日、商品名、担当社員名を日付の昇順に照会

In [ ]:
%%sql
SELECT
  sales.sales_date AS 取引日,
  item.name AS 商品名,
  employee.name AS 社員名
FROM
  sales
INNER JOIN
  item
ON
  sales.item_id = item.item_id
INNER JOIN
  employee
ON
  sales.employee_id = employee.employee_id
WHERE
  sales.sales_date BETWEEN '2021-12-10' AND '2021-12-11'
ORDER BY sales.sales_date
;

**演習１６**
item表、sales表、employee表から、社員名(sales表のname属性）、商品名（item表のname属性）ごとに販売数（sales表）と売上高（sales表のitem_id属性の合計数）に照会

In [ ]:
%%sql
SELECT
  employee.name AS 社員名,
  item.name AS 商品名,
  COUNT(*) AS 販売数,
  SUM(item.price) AS 売上額
FROM
  sales
INNER JOIN
  item
ON
  sales.item_id = item.item_id
INNER JOIN
  employee
ON
  sales.employee_id = employee.employee_id
GROUP BY
  sales.employee_id, sales.item_id
;

**演習１７**
item表、sales表、employee表から、社員名(sales表のname属性）ごとに販売数（sales表）と売上高（sales表のitem_id属性の合計数）を売上高の降順に照会

In [ ]:
%%sql
SELECT
  employee.name AS 社員名,
  COUNT(*) AS 販売数,
  SUM(item.price) AS 売上額
FROM
  sales
INNER JOIN
  item
ON
  sales.item_id = item.item_id
INNER JOIN
  employee
ON
  sales.employee_id = employee.employee_id
GROUP BY
  sales.employee_id
ORDER BY
  SUM(item.price) DESC
;